:PROPERTIES:
:ID:       06e659a8-7bec-495c-b0fe-7ca216311a34
:END:
#+title: berkeley
* Classes
** Taken
*** Su21
**** [[id:ae59b73e-705f-4735-9e78-a3bbabf99e6e][cs61a]], A
** Fa21
*** [[id:bf142b12-94eb-4561-9b84-0a5c04e5ff2d][cs61b]]
*** [[id:9cc23d47-c537-4606-bbcc-ba08170577e6][cs70]] 
*** [[id:fdf74abd-8449-4783-a092-cefd352411ce][math1b]]
*** [[id:b5a4e7bb-a4bd-40eb-b680-bf4aa14e1e26][bioe10]]
*** [[id:80d92004-134f-49d3-8e50-7abf92cd7ed0][bioe26]]
** Sp22
***  
** future

* TODO
regex for ids, find out how to only look at above headlines
highlight courses w/ no prereqs in red or smth

* This should really be its own file
#+BEGIN_SRC emacs-lisp

	  (defun getProp (id &optional prop)
	  (or prop (setq prop "PREREQS"))
	  ;returns prereqs property of a node with :ID: of id
	      (setq amongus (org-roam-node-from-id id))
	      (setq amogus (org-roam-node-properties amongus))

	  ;hard check the 'correct' index for prereqs (faster)
	      (if (string= (car (car (cdr amogus))) prop)
		(cdr (car (cdr amogus)))
	    (cdr (nth (cl-position prop (mapcar 'car amogus) :test 'equal) amogus))))

      (defun string-find-all (regexp str &optional start-pos)
	(cl-loop for match-pos = (string-match regexp str start-pos)
		 while match-pos
		 collect (match-string 1 str)
		 do (setf start-pos (1+ match-pos))))

    (defun find-all (regex string)
      (let ((matches))
	(with-temp-buffer
	  (insert string)
	  (goto-char (point-min))
	  (while (re-search-forward regex (point-max) t)
	    (push (match-string 1) matches)))
	matches))

	  (defun getPreReqs (id)
	    (setq pr (getProp id))
	    (if (eq "" pr) nil
	      (find-all "id:\\(.+?\\)\\]"  pr)))

	  (print (car (getPreReqs "92a591d0-a222-404b-a8e4-3a399e897546")))

      (string-find-all "id:\\(.+?\\)\\]" "The name of file is {NAME} and its location is {PATH}/{NAME}")
(org-element-interpret-data (org-element-parse-buffer))
    ;(org-element-put-property)

#+END_SRC

#+RESULTS:
#+begin_example
:PROPERTIES:
:ID:       06e659a8-7bec-495c-b0fe-7ca216311a34
:END:
,#+title: berkeley
,* Classes
,** Taken
,*** Su21
,**** [[id:ae59b73e-705f-4735-9e78-a3bbabf99e6e][cs61a]], A
,** Fa21
,*** [[id:bf142b12-94eb-4561-9b84-0a5c04e5ff2d][cs61b]]
,*** [[id:9cc23d47-c537-4606-bbcc-ba08170577e6][cs70]]
,*** [[id:fdf74abd-8449-4783-a092-cefd352411ce][math1b]]
,*** [[id:b5a4e7bb-a4bd-40eb-b680-bf4aa14e1e26][bioe10]]
,*** [[id:80d92004-134f-49d3-8e50-7abf92cd7ed0][bioe26]]
,** Sp22
,*** 
,** future

,* TODO
regex for ids, find out how to only look at above headlines
highlight courses w/ no prereqs in red or smth

,* This should really be its own file
,#+begin_src emacs-lisp

  	  (defun getProp (id &optional prop)
  	  (or prop (setq prop "PREREQS"))
  	  ;returns prereqs property of a node with :ID: of id
  	      (setq amongus (org-roam-node-from-id id))
  	      (setq amogus (org-roam-node-properties amongus))

  	  ;hard check the 'correct' index for prereqs (faster)
  	      (if (string= (car (car (cdr amogus))) prop)
  		(cdr (car (cdr amogus)))
  	    (cdr (nth (cl-position prop (mapcar 'car amogus) :test 'equal) amogus))))

        (defun string-find-all (regexp str &optional start-pos)
  	(cl-loop for match-pos = (string-match regexp str start-pos)
  		 while match-pos
  		 collect (match-string 1 str)
  		 do (setf start-pos (1+ match-pos))))

      (defun find-all (regex string)
        (let ((matches))
  	(with-temp-buffer
  	  (insert string)
  	  (goto-char (point-min))
  	  (while (re-search-forward regex (point-max) t)
  	    (push (match-string 1) matches)))
  	matches))

  	  (defun getPreReqs (id)
  	    (setq pr (getProp id))
  	    (if (eq "" pr) nil
  	      (find-all "id:\\(.+?\\)\\]"  pr)))

  	  (print (car (getPreReqs "92a591d0-a222-404b-a8e4-3a399e897546")))

        (string-find-all "id:\\(.+?\\)\\]" "The name of file is {NAME} and its location is {PATH}/{NAME}")
  (org-element-interpret-data (org-element-parse-buffer))
      ;(org-element-put-property)
,#+end_src

,#+results: 
| headline | (:raw-value TODO :begin 484 :end 599 :pre-blank 0 :contents-begin 491 :contents-end 598 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 484 :title (TODO) :parent (org-data nil (section (:begin 1 :end 86 :contents-begin 1 :contents-end 86 :post-blank 0 :post-affiliated 1 :parent #1) (property-drawer (:begin 1 :end 68 :contents-begin 14 :contents-end 62 :post-blank 0 :post-affiliated 1 :parent #2) (node-property (:key ID :value 06e659a8-7bec-495c-b0fe-7ca216311a34 :begin 14 :end 62 :post-blank 0 :post-affiliated 14 :parent #3))) (keyword (:key TITLE :value berkeley :begin 68 :end 86 :post-blank 0 :post-affiliated 68 :parent #2))) (headline (:raw-value Classes :begin 86 :end 484 :pre-blank 0 :contents-begin 96 :contents-end 483 :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 1 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 86 :title (Classes) :parent #1) (headline (:raw-value Taken :begin 96 :end 173 :pre-blank 0 :contents-begin 105 :contents-end 173 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 96 :title (Taken) :parent #2) (headline (:raw-value Su21 :begin 105 :end 173 :pre-blank 0 :contents-begin 114 :contents-end 173 :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 105 :title (Su21) :parent #3) (headline (:raw-value [[id:ae59b73e-705f-4735-9e78-a3bbabf99e6e][cs61a]], A :begin 114 :end 173 :pre-blank 0 :contents-begin nil :contents-end nil :level 4 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 114 :title ((link (:type id :path ae59b73e-705f-4735-9e78-a3bbabf99e6e :format bracket :raw-link id:ae59b73e-705f-4735-9e78-a3bbabf99e6e :application nil :search-option nil :begin 119 :end 169 :contents-begin 162 :contents-end 167 :post-blank 0 :parent #5) cs61a) , A) :parent #4)))) (headline (:raw-value Fa21 :begin 173 :end 459 :pre-blank 0 :contents-begin 181 :contents-end 459 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 173 :title (Fa21) :parent #2) (headline (:raw-value [[id:bf142b12-94eb-4561-9b84-0a5c04e5ff2d][cs61b]] :begin 181 :end 236 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 181 :title ((link (:type id :path bf142b12-94eb-4561-9b84-0a5c04e5ff2d :format bracket :raw-link id:bf142b12-94eb-4561-9b84-0a5c04e5ff2d :application nil :search-option nil :begin 185 :end 235 :contents-begin 228 :contents-end 233 :post-blank 0 :parent #4) cs61b)) :parent #3)) (headline (:raw-value [[id:9cc23d47-c537-4606-bbcc-ba08170577e6][cs70]] :begin 236 :end 291 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 236 :title ((link (:type id :path 9cc23d47-c537-4606-bbcc-ba08170577e6 :format bracket :raw-link id:9cc23d47-c537-4606-bbcc-ba08170577e6 :application nil :search-option nil :begin 240 :end 289 :contents-begin 283 :contents-end 287 :post-blank 0 :parent #4) cs70)) :parent #3)) (headline (:raw-value [[id:fdf74abd-8449-4783-a092-cefd352411ce][math1b]] :begin 291 :end 347 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 291 :title ((link (:type id :path fdf74abd-8449-4783-a092-cefd352411ce :format bracket :raw-link id:fdf74abd-8449-4783-a092-cefd352411ce :application nil :search-option nil :begin 295 :end 346 :contents-begin 338 :contents-end 344 :post-blank 0 :parent #4) math1b)) :parent #3)) (headline (:raw-value [[id:b5a4e7bb-a4bd-40eb-b680-bf4aa14e1e26][bioe10]] :begin 347 :end 403 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 347 :title ((link (:type id :path b5a4e7bb-a4bd-40eb-b680-bf4aa14e1e26 :format bracket :raw-link id:b5a4e7bb-a4bd-40eb-b680-bf4aa14e1e26 :application nil :search-option nil :begin 351 :end 402 :contents-begin 394 :contents-end 400 :post-blank 0 :parent #4) bioe10)) :parent #3)) (headline (:raw-value [[id:80d92004-134f-49d3-8e50-7abf92cd7ed0][bioe26]] :begin 403 :end 459 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 403 :title ((link (:type id :path 80d92004-134f-49d3-8e50-7abf92cd7ed0 :format bracket :raw-link id:80d92004-134f-49d3-8e50-7abf92cd7ed0 :application nil :search-option nil :begin 407 :end 458 :contents-begin 450 :contents-end 456 :post-blank 0 :parent #4) bioe26)) :parent #3))) (headline (:raw-value Sp22 :begin 459 :end 473 :pre-blank 0 :contents-begin 467 :contents-end 473 :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 459 :title (Sp22) :parent #2) (headline (:raw-value  :begin 467 :end 473 :pre-blank 0 :contents-begin nil :contents-end nil :level 3 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 467 :title () :parent #3))) (headline (:raw-value future :begin 473 :end 483 :pre-blank 0 :contents-begin nil :contents-end nil :level 2 :priority nil :tags nil :todo-keyword nil :todo-type nil :post-blank 0 :footnote-section-p nil :archivedp nil :commentedp nil :post-affiliated 473 :title (future) :parent #2))) (headline #0 (section (:begin 491 :end 599 :contents-begin 491 :contents-end 598 :post-blank 1 :post-affiliated 491 :parent #2) (paragraph (:begin 491 :end 598 :contents-begin 491 :contents-end 598 :post-blank 0 :post-affiliated 491 :parent #3) regex for ids, find out how to only look at above headlines |



[[id:a33d7edb-eaf0-4601-ac04-87e32755885c][futurecourses]]
#+end_example



[[id:a33d7edb-eaf0-4601-ac04-87e32755885c][futurecourses]]
